tangb765/FredFoc/gimbal/stm32f40x/drivers/usart.c
/*
 * File      : usart.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2009, RT-Thread Development Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2009-01-05     Bernard      the first version
 * 2010-03-29     Bernard      remove interrupt Tx and DMA Rx mode
 * 2012-02-08     aozima       update for F4.
 * 2012-07-28     aozima       update for ART board.
 */

#include "stm32f4xx.h"
#include "usart.h"
#include "board.h"

#include <rtdevice.h>

/* config */
#define RT_USING_UART1_DMA
#define RT_USING_UART3_DMA

/* UART GPIO define. */
#define UART1_GPIO_TX       GPIO_Pin_6
#define UART1_TX_PIN_SOURCE GPIO_PinSource6
#define UART1_GPIO_RX       GPIO_Pin_7
#define UART1_RX_PIN_SOURCE GPIO_PinSource7
#define UART1_GPIO          GPIOB
#define UART1_GPIO_RCC      RCC_AHB1Periph_GPIOB
#define RCC_APBPeriph_UART1 RCC_APB2Periph_USART1
#define UART1_TX_DMA        DMA2_Stream7
#define UART1_RX_DMA        DMA2_Stream5


#define UART3_GPIO_TX       GPIO_Pin_10
#define UART3_TX_PIN_SOURCE GPIO_PinSource10
#define UART3_GPIO_RX       GPIO_Pin_11
#define UART3_RX_PIN_SOURCE GPIO_PinSource11
#define UART3_GPIO          GPIOB
#define UART3_GPIO_RCC      RCC_AHB1Periph_GPIOB
#define RCC_APBPeriph_UART3 RCC_APB1Periph_USART3
#define UART3_TX_DMA        DMA1_Stream3
#define UART3_RX_DMA        DMA1_Stream1

#define BUFSIZE  64 //RT_CONSOLEBUF_SIZE

struct rt_uart_rx_fifo
{
	/* software fifo */
	rt_uint8_t buffer[BUFSIZE];
//	rt_uint8_t *buffer;

	rt_uint16_t put_index, get_index;
};

struct rt_uart_tx_fifo
{
	/* software fifo */
	rt_uint8_t buffer[BUFSIZE];
//	rt_uint8_t *buffer;

	rt_uint16_t put_index, get_index;
};

#if defined(RT_USING_UART1)
rt_uint8_t txbuf[BUFSIZE];
rt_uint8_t rxbuf[BUFSIZE];
//rt_uint8_t rxbuf_ref[BUFSIZE];
//uint16_t rxbuf_len = 0;
//struct rt_uart_rx_fifo uart1_rx_fifo;
struct rt_uart_tx_fifo uart1_tx_fifo;
#endif

#if defined(RT_USING_UART3)
rt_uint8_t tx3buf[BUFSIZE];
rt_uint8_t rx3buf[BUFSIZE];
//rt_uint8_t rx3buf_ref[BUFSIZE];
//uint16_t rx3buf_len = 0;
//struct rt_uart_rx_fifo uart3_rx_fifo;
struct rt_uart_tx_fifo uart3_tx_fifo;
#endif

/* STM32 uart driver */
struct stm32_uart
{
    USART_TypeDef *uart_device;
    IRQn_Type irq;
		DMA_Stream_TypeDef* tx_dma_channel;	
		IRQn_Type DMA_irq;
};

#if defined(RT_USING_UART1)
/* UART1 device driver structure */
struct stm32_uart uart1 =
{
    USART1,
    USART1_IRQn,
		DMA2_Stream7,
		DMA2_Stream7_IRQn,	
};
struct rt_serial_device serial1;
#endif

#if defined(RT_USING_UART3)
/* UART3 device driver structure */
struct stm32_uart uart3 =
{
    USART3,
    USART3_IRQn,
		DMA1_Stream3,
		DMA1_Stream3_IRQn,
};
struct rt_serial_device serial3;
#endif

static rt_err_t stm32_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct stm32_uart *uart;
    USART_InitTypeDef USART_InitStructure;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

    uart = (struct stm32_uart *)serial->parent.user_data;

		if (cfg->baud_rate == BAUD_RATE_2400)
					USART_InitStructure.USART_BaudRate = 2400;
		else if (cfg->baud_rate == BAUD_RATE_4800)
					USART_InitStructure.USART_BaudRate = 4800;
		else if (cfg->baud_rate == BAUD_RATE_9600)
					USART_InitStructure.USART_BaudRate = 9600;
		else if (cfg->baud_rate == BAUD_RATE_38400)
					USART_InitStructure.USART_BaudRate = 38400;
		else if (cfg->baud_rate == BAUD_RATE_57600)
					USART_InitStructure.USART_BaudRate = 57600;
		else if (cfg->baud_rate == BAUD_RATE_115200)
					USART_InitStructure.USART_BaudRate = 115200;
		else if (cfg->baud_rate == BAUD_RATE_230400)
					USART_InitStructure.USART_BaudRate = 230400;
		else if (cfg->baud_rate == BAUD_RATE_460800)
					USART_InitStructure.USART_BaudRate = 460800;
		else if (cfg->baud_rate == BAUD_RATE_921600)
					USART_InitStructure.USART_BaudRate = 921600;

    if (cfg->data_bits == DATA_BITS_8)
    {
        USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    }
    else if (cfg->data_bits == DATA_BITS_9)
    {
        USART_InitStructure.USART_WordLength = USART_WordLength_9b;
    }

    if (cfg->stop_bits == STOP_BITS_1)
        USART_InitStructure.USART_StopBits = USART_StopBits_1;
    else if (cfg->stop_bits == STOP_BITS_2)
        USART_InitStructure.USART_StopBits = USART_StopBits_2;

    if (cfg->parity == PARITY_NONE)
    {
        USART_InitStructure.USART_Parity = USART_Parity_No;
    }
    else if (cfg->parity == PARITY_ODD)
    {
        USART_InitStructure.USART_Parity = USART_Parity_Odd;
    }
    else if (cfg->parity == PARITY_EVEN)
    {
        USART_InitStructure.USART_Parity = USART_Parity_Even;
    }

    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(uart->uart_device, &USART_InitStructure);

    /* Enable USART */
    USART_Cmd(uart->uart_device, ENABLE);

    return RT_EOK;
}

static rt_err_t stm32_control(struct rt_serial_device *serial, int cmd, void *arg)
{
    struct stm32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct stm32_uart *)serial->parent.user_data;

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        /* disable rx irq */
        UART_DISABLE_IRQ(uart->irq);
        /* disable interrupt */
        USART_ITConfig(uart->uart_device, USART_IT_RXNE, DISABLE);
        break;
    case RT_DEVICE_CTRL_SET_INT:
        /* enable rx irq */
        UART_ENABLE_IRQ(uart->irq);
        /* enable interrupt */
        USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
        break;
    }

    return RT_EOK;
}

static int stm32_putc(struct rt_serial_device *serial, char c)
{
    struct stm32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct stm32_uart *)serial->parent.user_data;

    while (!(uart->uart_device->SR & USART_FLAG_TXE));
    uart->uart_device->DR = c;

    return 1;
}

