tangb765/FredFoc/gimbal/stm32f40x/drivers/usart.c
static int stm32_getc(struct rt_serial_device *serial)
{
    int ch;
    struct stm32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct stm32_uart *)serial->parent.user_data;

    ch = -1;
    if (uart->uart_device->SR & USART_FLAG_RXNE)
    {
        ch = uart->uart_device->DR & 0xff;
    }

    return ch;
}

static void uart1_tx_idle_hook()
{
#if defined(RT_USING_UART1)
	rt_base_t level;	
	
	if (uart1_tx_fifo.get_index != uart1_tx_fifo.put_index && DMA_GetCmdStatus(uart1.tx_dma_channel) == DISABLE)
	{
		rt_size_t count=0;
		rt_size_t length=0; 					
		rt_size_t ch=0; 
		
		if (uart1_tx_fifo.get_index < uart1_tx_fifo.put_index)
		{
			count = uart1_tx_fifo.put_index - uart1_tx_fifo.get_index;
		}
		else
		{
			count = BUFSIZE - uart1_tx_fifo.get_index + uart1_tx_fifo.put_index;
		}
		
		length = count;
		
		/* disable interrupt */ 
		level = rt_hw_interrupt_disable();
		
		while (count)
		{			
				if (uart1_tx_fifo.get_index != uart1_tx_fifo.put_index)
				{
						txbuf[ch] = uart1_tx_fifo.buffer[uart1_tx_fifo.get_index];
						uart1_tx_fifo.get_index += 1;
						ch++;
						if (uart1_tx_fifo.get_index >= BUFSIZE) 
							uart1_tx_fifo.get_index = 0;
				}
				else
				{
				
				}

				count --;
		}
		
		/* enable interrupt */
		rt_hw_interrupt_enable(level);		
		
		
		/* set buffer address */
		uart1.tx_dma_channel->M0AR = (rt_uint32_t) txbuf;
		
		/* set size */
		uart1.tx_dma_channel->NDTR = length;
		/* enable DMA */
		DMA_Cmd(uart1.tx_dma_channel, ENABLE);	
	}
#endif
}

static void uart3_tx_idle_hook()
{
#if defined(RT_USING_UART3)
	rt_base_t level;	
	
	if (uart3_tx_fifo.get_index != uart3_tx_fifo.put_index && DMA_GetCmdStatus(uart3.tx_dma_channel) == DISABLE)
	{
		rt_size_t count=0;
		rt_size_t length=0; 					
		rt_size_t ch=0; 
		
		if (uart3_tx_fifo.get_index < uart3_tx_fifo.put_index)
		{
			count = uart3_tx_fifo.put_index - uart3_tx_fifo.get_index;
		}
		else
		{
			count = BUFSIZE - uart3_tx_fifo.get_index + uart3_tx_fifo.put_index;
		}
		
		length = count;
		
		/* disable interrupt */ 
		level = rt_hw_interrupt_disable();
		
		while (count)
		{			
				if (uart3_tx_fifo.get_index != uart3_tx_fifo.put_index)
				{
						tx3buf[ch] = uart3_tx_fifo.buffer[uart3_tx_fifo.get_index];
						uart3_tx_fifo.get_index += 1;
						ch++;
						if (uart3_tx_fifo.get_index >= BUFSIZE) 
							uart3_tx_fifo.get_index = 0;
				}
				else
				{
					
				}

				count --;
		}
		
		/* enable interrupt */
		rt_hw_interrupt_enable(level);
		
		/* set buffer address */
		uart3.tx_dma_channel->M0AR = (rt_uint32_t) tx3buf;
		/* set size */
		uart3.tx_dma_channel->NDTR = length;
		/* enable DMA */
		DMA_Cmd(uart3.tx_dma_channel, ENABLE);	
	}
#endif	
}

void uart_tx_idle_hook()
{
//	rt_base_t level;
	
//	/* disable interrupt */ 
//	level = rt_hw_interrupt_disable();
	
	uart1_tx_idle_hook();
	uart3_tx_idle_hook();
	
//	/* enable interrupt */
//	rt_hw_interrupt_enable(level);
}


rt_size_t stm32_dma_transmit(struct rt_serial_device *serial,const rt_uint8_t *buf, rt_size_t size, int direction)
{
    struct stm32_uart *uart;
		rt_base_t level;	
		rt_size_t length;
	
	
    RT_ASSERT(serial != RT_NULL);
    uart = (struct stm32_uart *)serial->parent.user_data;
	
	  /* disable interrupt */ 
		level = rt_hw_interrupt_disable();

#if defined(RT_USING_UART1)
		if(uart == &uart1)
		{
			uint16_t len = 0; 
			uint16_t len_i = 0; 
			
			if (direction == RT_SERIAL_DMA_TX)
			{
				len = size;
				while(len>0)
				{
					if (buf[len_i]=='\n' && buf[len_i-1]!='\r')
					{
						uart1_tx_fifo.buffer[uart1_tx_fifo.put_index] = '\r';
						uart1_tx_fifo.put_index += 1;
						if (uart1_tx_fifo.put_index >= BUFSIZE) uart1_tx_fifo.put_index = 0;
						
						/* if the next position is read index, discard this 'read char' */
						if (uart1_tx_fifo.put_index == uart1_tx_fifo.get_index)
						{
								uart1_tx_fifo.get_index += 1;
								if (uart1_tx_fifo.get_index >= BUFSIZE) uart1_tx_fifo.get_index = 0;
						}					
					}
					
					uart1_tx_fifo.buffer[uart1_tx_fifo.put_index] = buf[len_i];
					uart1_tx_fifo.put_index += 1;
					if (uart1_tx_fifo.put_index >= BUFSIZE) uart1_tx_fifo.put_index = 0;
					
					/* if the next position is read index, discard this 'read char' */
					if (uart1_tx_fifo.put_index == uart1_tx_fifo.get_index)
					{
							uart1_tx_fifo.get_index += 1;
							if (uart1_tx_fifo.get_index >= BUFSIZE) uart1_tx_fifo.get_index = 0;
					}
					len--;			
					len_i++;
				}
				
				rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);	

				length = size;
			}
			else
			{
//				rt_size_t ch = 0;

				length = size; 
//				while (size)
//				{			
//						if (uart1_rx_fifo.get_index != uart1_rx_fifo.put_index)
//						{
//								rxbuf_ref[ch] = uart1_rx_fifo.buffer[uart1_rx_fifo.get_index];
//								uart1_rx_fifo.get_index += 1;
//								ch++;
//								if (uart1_rx_fifo.get_index >= BUFSIZE) 
//									uart1_rx_fifo.get_index = 0;
//						}
//						else
//						{
//								/* no data, enable interrupt and break out */
//								length = 0;
//						}

//						size --;
//				}
//				
//				if (length != size) rt_memcpy((void*)buf,rxbuf_ref,length - size);

//				length = length - size;
				
				rt_memcpy((void*)buf,rxbuf,length);

				DMA_SetCurrDataCounter(UART1_RX_DMA,BUFSIZE);  
				DMA_Cmd(UART1_RX_DMA,ENABLE);  
							
			}
		}
#endif
		
#if defined(RT_USING_UART3)
		if(uart==&uart3)
		{
			uint16_t len = 0; 
			uint16_t len_i = 0; 
			
			if (direction == RT_SERIAL_DMA_TX)
			{
				len = size;
				while(len>0)
				{
					if (buf[len_i]=='\n' && buf[len_i-1]!='\r')
					{
						uart3_tx_fifo.buffer[uart3_tx_fifo.put_index] = '\r';
						uart3_tx_fifo.put_index += 1;
						if (uart3_tx_fifo.put_index >= BUFSIZE) uart3_tx_fifo.put_index = 0;
						
						/* if the next position is read index, discard this 'read char' */
						if (uart3_tx_fifo.put_index == uart3_tx_fifo.get_index)
						{
								uart3_tx_fifo.get_index += 1;
								if (uart3_tx_fifo.get_index >= BUFSIZE) uart3_tx_fifo.get_index = 0;
						}					
					}
					
					uart3_tx_fifo.buffer[uart3_tx_fifo.put_index] = buf[len_i];
					uart3_tx_fifo.put_index += 1;
					if (uart3_tx_fifo.put_index >= BUFSIZE) uart3_tx_fifo.put_index = 0;
					
					/* if the next position is read index, discard this 'read char' */
					if (uart3_tx_fifo.put_index == uart3_tx_fifo.get_index)
					{
							uart3_tx_fifo.get_index += 1;
							if (uart3_tx_fifo.get_index >= BUFSIZE) uart3_tx_fifo.get_index = 0;
					}
					len--;			
					len_i++;
				}
				
