tangb765/FredFoc/gimbal/stm32f40x/drivers/usart.c
				rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);	

				length = size;
			}
			else
			{
//				rt_size_t ch = 0;
				
				length = size; 
//				while (size)
//				{			
//						if (uart3_rx_fifo.get_index != uart3_rx_fifo.put_index)
//						{
//								rx3buf_ref[ch] = uart3_rx_fifo.buffer[uart3_rx_fifo.get_index];
//								uart3_rx_fifo.get_index += 1;
//								ch++;
//								if (uart3_rx_fifo.get_index >= BUFSIZE) 
//									uart3_rx_fifo.get_index = 0;
//						}
//						else
//						{
//								/* no data, enable interrupt and break out */
//								length = 0;
//						}

//						size --;
//				}
//				
//				if (length != size) rt_memcpy((void*)buf,rx3buf_ref,length - size);

//				length = length - size;	
				
				rt_memcpy((void*)buf,rx3buf,length);

				DMA_SetCurrDataCounter(UART3_RX_DMA,BUFSIZE);  
				DMA_Cmd(UART3_RX_DMA,ENABLE);  
						
			}	
		}
#endif
		
		
		/* enable interrupt */
		rt_hw_interrupt_enable(level);
		
		return length;
}

static const struct rt_uart_ops stm32_uart_ops =
{
    stm32_configure,
    stm32_control,
    stm32_putc,
    stm32_getc,
    stm32_dma_transmit,
};

#if defined(RT_USING_UART1)
void USART1_IRQHandler(void)
{
    struct stm32_uart *uart;

    uart = &uart1;

    /* enter interrupt */
    rt_interrupt_enter();
    if (USART_GetITStatus(uart->uart_device, USART_IT_RXNE) != RESET)
    {
        rt_hw_serial_isr(&serial1, RT_SERIAL_EVENT_RX_IND);
    }
    if (USART_GetITStatus(uart->uart_device, USART_IT_TC) != RESET)
    {
        /* clear interrupt */
        USART_ClearITPendingBit(uart->uart_device, USART_IT_TC);
    }

		
    if(USART_GetITStatus(USART1, USART_IT_IDLE) != RESET)  
    {  
				rt_size_t len = 0; 
			  rt_size_t len_i = 0; 
				
				USART1->SR;  
				USART1->DR;

				DMA_Cmd(UART1_RX_DMA,DISABLE);  
				DMA_ClearFlag(UART1_RX_DMA,DMA_FLAG_TCIF5);  
					
			  len = BUFSIZE - DMA_GetCurrDataCounter(UART1_RX_DMA);
				
				len_i = 0; 
				while(len_i<len)
				{
					if(rxbuf[len_i] == '#')
						break;

					len_i++;
				}
				
				if (len_i>=len)
				{
					len_i = 0; 
					
					while(len_i<len)
					{
						if (rxbuf[len_i]=='\n' && rxbuf[len_i-1]!='\r')
						{
							uart1_tx_fifo.buffer[uart1_tx_fifo.put_index] = '\r';
							uart1_tx_fifo.put_index += 1;
							if (uart1_tx_fifo.put_index >= BUFSIZE) uart1_tx_fifo.put_index = 0;
							
							/* if the next position is read index, discard this 'read char' */
							if (uart1_tx_fifo.put_index == uart1_tx_fifo.get_index)
							{
									uart1_tx_fifo.get_index += 1;
									if (uart1_tx_fifo.get_index >= BUFSIZE) uart1_tx_fifo.get_index = 0;
							}					
						}
						
						uart1_tx_fifo.buffer[uart1_tx_fifo.put_index] = rxbuf[len_i];
						uart1_tx_fifo.put_index += 1;
						if (uart1_tx_fifo.put_index >= BUFSIZE) uart1_tx_fifo.put_index = 0;
						
						/* if the next position is read index, discard this 'read char' */
						if (uart1_tx_fifo.put_index == uart1_tx_fifo.get_index)
						{
								uart1_tx_fifo.get_index += 1;
								if (uart1_tx_fifo.get_index >= BUFSIZE) uart1_tx_fifo.get_index = 0;
						}	
						len_i++;
					}
					
					DMA_SetCurrDataCounter(UART1_RX_DMA,BUFSIZE);  
					DMA_Cmd(UART1_RX_DMA,ENABLE); 
				}
				else
				{
//					len_i = 0; 
//					while(len_i<len)
//					{
//						uart1_rx_fifo.buffer[uart1_rx_fifo.put_index] = rxbuf[len_i];
//						uart1_rx_fifo.put_index += 1;
//						if (uart1_rx_fifo.put_index >= BUFSIZE) uart1_rx_fifo.put_index = 0;
//						
//						/* if the next position is read index, discard this 'read char' */
//						if (uart1_rx_fifo.put_index == uart1_rx_fifo.get_index)
//						{
//								uart1_rx_fifo.get_index += 1;
//								if (uart1_rx_fifo.get_index >= BUFSIZE) uart1_rx_fifo.get_index = 0;
//						}
//		
//						len_i++;
//					}
					
					if (len>0)
						rt_hw_serial_isr(&serial1, ((len << 8) & (~0xff)) | RT_SERIAL_EVENT_RX_DMADONE);
				}
    }   

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef RT_USING_UART1_DMA
void DMA2_Stream7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();
    if (DMA_GetITStatus(UART1_TX_DMA, DMA_IT_TCIF7) != RESET)
    {
				DMA_Cmd(UART1_TX_DMA, DISABLE);
        DMA_ClearFlag(UART1_TX_DMA, DMA_FLAG_TCIF7);
    }

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#endif /* RT_USING_UART1 */


#if defined(RT_USING_UART3)
void USART3_IRQHandler(void)
{
    struct stm32_uart *uart;

    uart = &uart3;

    /* enter interrupt */
    rt_interrupt_enter();
    if (USART_GetITStatus(uart->uart_device, USART_IT_RXNE) != RESET)
    {
        rt_hw_serial_isr(&serial3, RT_SERIAL_EVENT_RX_IND);
    }
    if (USART_GetITStatus(uart->uart_device, USART_IT_TC) != RESET)
    {
        /* clear interrupt */
        USART_ClearITPendingBit(uart->uart_device, USART_IT_TC);
    }

    if(USART_GetITStatus(USART3, USART_IT_IDLE) != RESET)  
    {  
				rt_size_t len = 0; 
			  rt_size_t len_i = 0; 
				
				USART3->SR;  
				USART3->DR;

				DMA_Cmd(UART3_RX_DMA,DISABLE);  
				DMA_ClearFlag(UART3_RX_DMA,DMA_FLAG_TCIF1);  
					
			  len = BUFSIZE - DMA_GetCurrDataCounter(UART3_RX_DMA);
				
				len_i = 0; 
				while(len_i<len)
				{
					if(rx3buf[len_i] == '#')
						break;
					len_i++;
				}
				
				if (len_i>=len)
				{
					len_i = 0; 
					
					while(len_i<len)
					{
						if (rx3buf[len_i]=='\n' && rx3buf[len_i-1]!='\r')
						{
							uart1_tx_fifo.buffer[uart1_tx_fifo.put_index] = '\r';
							uart1_tx_fifo.put_index += 1;
							if (uart1_tx_fifo.put_index >= BUFSIZE) uart1_tx_fifo.put_index = 0;
							
							/* if the next position is read index, discard this 'read char' */
							if (uart1_tx_fifo.put_index == uart1_tx_fifo.get_index)
							{
									uart1_tx_fifo.get_index += 1;
									if (uart1_tx_fifo.get_index >= BUFSIZE) uart1_tx_fifo.get_index = 0;
							}					
						}
						
						uart1_tx_fifo.buffer[uart1_tx_fifo.put_index] = rx3buf[len_i];
						uart1_tx_fifo.put_index += 1;
						if (uart1_tx_fifo.put_index >= BUFSIZE) uart1_tx_fifo.put_index = 0;
						
						/* if the next position is read index, discard this 'read char' */
						if (uart1_tx_fifo.put_index == uart1_tx_fifo.get_index)
						{
								uart1_tx_fifo.get_index += 1;
								if (uart1_tx_fifo.get_index >= BUFSIZE) uart1_tx_fifo.get_index = 0;
						}	
						len_i++;
					}
					
					DMA_SetCurrDataCounter(UART3_RX_DMA,BUFSIZE);  
					DMA_Cmd(UART3_RX_DMA,ENABLE); 
				}
				else
				{
//					len_i = 0;
//			
//					while(len_i<len)
//					{
//						uart3_rx_fifo.buffer[uart3_rx_fifo.put_index] = rx3buf[len_i];
//						uart3_rx_fifo.put_index += 1;
//						if (uart3_rx_fifo.put_index >= BUFSIZE) uart3_rx_fifo.put_index = 0;
//						
//						/* if the next position is read index, discard this 'read char' */
//						if (uart3_rx_fifo.put_index == uart3_rx_fifo.get_index)
//						{
//								uart3_rx_fifo.get_index += 1;
//								if (uart3_rx_fifo.get_index >= BUFSIZE) uart3_rx_fifo.get_index = 0;
//						}
//		
//						len_i++;
//					}

	
					if (len>0)
						rt_hw_serial_isr(&serial3, ((len << 8) & (~0xff)) | RT_SERIAL_EVENT_RX_DMADONE);
				}
    }   

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef RT_USING_UART3_DMA
void DMA1_Stream3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();
    if (DMA_GetITStatus(UART3_TX_DMA, DMA_IT_TCIF3) != RESET)
    {
				DMA_Cmd(UART3_TX_DMA, DISABLE);
        DMA_ClearFlag(UART3_TX_DMA, DMA_FLAG_TCIF3);
    }
    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#endif /* RT_USING_UART3 */

