tangb765/FredFoc/gimbal/stm32f40x/drivers/usart.c
    RCC_Configuration();
    GPIO_Configuration();
		DMA_Configuration();

#ifdef RT_USING_UART1	
    uart = &uart1;

    serial1.ops    = &stm32_uart_ops;
    serial1.config = config;

    NVIC_Configuration(&uart1);

    /* register UART1 device */
    rt_hw_serial_register(&serial1,
                          "uart1",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_DMA_RX | RT_DEVICE_FLAG_DMA_TX,
                          uart);
	
#ifdef RT_USING_UART1_DMA
//		rt_memset(uart1_rx_fifo.buffer, 0, BUFSIZE);
//		uart1_rx_fifo.put_index = 0;
//		uart1_rx_fifo.get_index = 0;
		
		rt_memset(uart1_tx_fifo.buffer, 0, BUFSIZE);
		uart1_tx_fifo.put_index = 0;
		uart1_tx_fifo.get_index = 0;		

    /* Enable USART1 DMA Tx request */
    USART_DMACmd(USART1, USART_DMAReq_Tx , ENABLE);
		USART_DMACmd(USART1, USART_DMAReq_Rx , ENABLE);  
		
		rt_thread_idle_sethook(uart_tx_idle_hook);		
		
#endif  /* RT_USING_UART1_DMA */

#endif /* RT_USING_UART1 */

#ifdef RT_USING_UART3
    uart = &uart3;

    serial3.ops    = &stm32_uart_ops;
    serial3.config = config;

    NVIC_Configuration(&uart3);

    /* register UART3 device */
    rt_hw_serial_register(&serial3,
                          "uart3",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_DMA_RX | RT_DEVICE_FLAG_DMA_TX,
                          uart);
													
#ifdef RT_USING_UART1_DMA
//		rt_memset(uart3_rx_fifo.buffer, 0, BUFSIZE);
//		uart3_rx_fifo.put_index = 0;
//		uart3_rx_fifo.get_index = 0;
		
		rt_memset(uart3_tx_fifo.buffer, 0, BUFSIZE);
		uart3_tx_fifo.put_index = 0;
		uart3_tx_fifo.get_index = 0;		

    /* Enable USART1 DMA Tx request */
    USART_DMACmd(USART3, USART_DMAReq_Tx , ENABLE);
		USART_DMACmd(USART3, USART_DMAReq_Rx , ENABLE);  
		
		rt_thread_idle_sethook(uart_tx_idle_hook);		
		
#endif  /* RT_USING_UART1_DMA */
#endif /* RT_USING_UART3 */

    return 0;
}
INIT_BOARD_EXPORT(stm32_hw_usart_init);
